{
  "result": [
    {
      "Question": "Amazon Glacier는 무엇을 위해 설계되었습니까? (정답 2개)",
      "A": "0",
      "AText": "활성 데이터베이스 스토리지",
      "B": "1",
      "BText": "자주 액세스하지 않는 데이터",
      "C": "1",
      "CText": "데이터 아카이브",
      "D": "0",
      "DText": "자주 액세스하는 데이터",
      "E": "0",
      "EText": "세션 데이터 캐싱"
    },
    {
      "Question": "웹 애플리케이션 프런트 엔드가 Elastic Load Balancer 뒤에 복수의 EC2 인스턴스로 구성되어 있습니다. 그리고 이러한 EC2 인스턴스의 정상 동작 체크를 수행하도록 ELB를 구성했습니다. 한 인스턴스가 정상 동작 체크를 통과하지 못하는 경우 다음 중 올바른 설명은 무엇입니까?",
      "A": "0",
      "AText": "ELB가 자동으로 인스턴스를 교체합니다.",
      "B": "0",
      "BText": "ELB가 자동으로 해당 인스턴스를 종료합니다.",
      "C": "1",
      "CText": "ELB는 정상 동작 체크에 실패한 인스턴스로의 트래픽 전송을 중단합니다.",
      "D": "0",
      "DText": "ELB가 근본 원인 분석을 위해 해당 인스턴스를 격리합니다."
    },
    {
      "Question": "재해 복구(DR) 시나리오에서 RDS의 어떤 기능이 가장 낮은 복구 비용을 제공합니까?",
      "A": "0",
      "AText": "RDS 멀티-AZ",
      "B": "0",
      "BText": "RDS 읽기-복제",
      "C": "1",
      "CText": "RDS DB 스냅샷",
      "D": "0",
      "DText": "RDS 프로비저닝된 IOPS",
      "E": "0",
      "EText": "RDS Import/Export"
    },
    {
      "Question": "기밀 정보인 교육 동영상을 직원에게 배포하는 시스템을 구축하고 있습니다. CloudFront를 사용하여 S3에 저장된 콘텐츠를 제공하지만, S3에 직접적인 퍼블릭 액세스는 불가능하도록 하려면 어떤 방법을 사용해야 합니까?",
      "A": "1",
      "AText": "CloudFront에 대한 원본 액세스 ID(OAI)를 생성한 다음 해당 OAI에 S3 버킷에 있는 객체에 대한 액세스 권한을 부여합니다.",
      "B": "0",
      "BText": "CloudFront 계정 보안 그룹 amazon-cf/amazon-cf-sg를 적절한 S3 버킷 정책에 추가합니다.",
      "C": "0",
      "CText": "CloudFront에 대한 Identity and Access Management(IAM) 사용자를 생성한 다음 해당 IAM 사용자에게 S3 버킷에 있는 객체에 대한 액세스 권한을 부여합니다.",
      "D": "0",
      "DText": "CloudFront 배포 ID는 보안 주체로, 대상 버킷은 Amazon Resource Name(ARN)으로 나열하는 S3 버킷 정책을 생성합니다."
    },
    {
      "Question": "다음 중 VPC(Virtual Private Cloud)에서 Elastic IP가 부여된 EC2 인스턴스가 중지되고 다시 시작될 때 발생하는 상황은 무엇입니까? (정답 2개)",
      "A": "0",
      "AText": "Elastic IP와 인스턴스의 연결이 해제됩니다.",
      "B": "1",
      "BText": "인스턴스-스토어 디바이스에 있는 모든 데이터가 손실됩니다.",
      "C": "0",
      "CText": "EBS(Elastic Block Store) 디바이스에 있는 모든 데이터가 손실됩니다.",
      "D": "0",
      "DText": "ENI(Elastic Network Interface)가 분리됩니다.",
      "E": "1",
      "EText": "인스턴스의 기본 호스트가 변경됩니다."
    },
    {
      "Question": "EC2의 기본 모니터링 패키지에서 Amazon CloudWatch는 다음과 같은 메트릭을 제공합니다.",
      "A": "0",
      "AText": "실패한 트랜잭션 요청 수 등의 웹 서버 가시적 메트릭",
      "B": "0",
      "BText": "메모리 사용량 등의 운영 체제 가시적 메트릭",
      "C": "0",
      "CText": "연결 수 등의 데이터베이스 가시적 메트릭",
      "D": "1",
      "DText": "CPU 사용량 등의 하이퍼바이저 가시적 메트릭"
    },
    {
      "Question": "다음 중 AWS에서 데이터 보안을 위해 수행하는 운영 프로세스는 무엇입니까?",
      "A": "0",
      "AText": "공유 스토리지 디바이스에 저장된 데이터의 AES-256 암호화",
      "B": "1",
      "BText": "업계 표준 방식을 사용하는 스토리지 디바이스 폐기",
      "C": "0",
      "CText": "EBS 볼륨 및 EBS 스냅샷의 백그라운드 바이러스 검사",
      "D": "0",
      "DText": "여러 AWS 지역 간의 데이터 복제",
      "E": "0",
      "EText": "EBS 볼륨이 마운트 해제될 때, EBS 데이터의 안전한 삭제"
    },
    {
      "Question": "S3 데이터를 실수로 삭제하고 덮어쓰는 것을 방지하기 위해서는",
      "A": "1",
      "AText": "버킷에서 S3 버전 관리를 사용해야 합니다.",
      "B": "0",
      "BText": "서명된 URL만 사용하여 S3 데이터에 액세스해야 합니다.",
      "C": "0",
      "CText": "IAM 버킷 정책을 사용하여 S3 삭제가 불가능하도록 해야 합니다.",
      "D": "0",
      "DText": "S3 Reduced Redundancy Storage를 사용하도록 설정해야 합니다.",
      "E": "0",
      "EText": "Multi-Factor Authentication(MFA) 보호 액세스를 사용하도록 설정해야 합니다."
    },
    {
      "Question": "Under a single AWS account, you have set up an Auto Scaling group with a maximum capacity of 50 Amazon Elastic Compute Cloud (Amazon EC2) instances in us-west-2. When you scale out, however, it only increases to 20 Amazon EC2 instance. What is the likely cause?",
      "A": "0",
      "AText": "Auto Scaling has a hard limit of 20 Amazon EC2 instances.",
      "B": "0",
      "BText": "If not specified, the Auto Scaling group maximum capacity defaults to 20 Amazon EC2 instance.",
      "C": "0",
      "CText": "The Auto Scaling group desired capacity is set to 20, so Auto Scaling stopped at 20 Amazon EC2 instance.",
      "D": "1",
      "DText": "You have exceeded the default Amazon EC2 instance limit of 20 per region."
    },
    {
      "Question": "Elastic Load Balancing allows you to distribute traffic across which of the following?",
      "A": "0",
      "AText": "Only within a single Availability Zone.",
      "B": "1",
      "BText": "Multiple Availability Zones within a region.",
      "C": "0",
      "CText": "Multiple Availability Zones within and between region.",
      "D": "0",
      "DText": "Multiple Availability Zones within and between regions and on-premises virtualized instances running OpenStack."
    },
    {
      "Question": "Amazon CloudWatch offers which types of monitoring plans? (Choose 2 answers)",
      "A": "1",
      "AText": "Basic",
      "B": "1",
      "BText": "Detailed",
      "C": "0",
      "CText": "Diagnostic",
      "D": "0",
      "DText": "Precognitive",
      "E": "0",
      "EText": "Retroactive"
    },
    {
      "Question": "An Amazon Elastic Compute Cloud (Amazon EC2) instance in an Amazon Virtual Private Cloud (Amazon VPC) subnet can send and receive traffic from the Internet when which of the following conditions are met? (Choose 3 answers)",
      "A": "0",
      "AText": "Network Access Control Lists (ACLs) and security group rules disallow all traffic.",
      "B": "1",
      "BText": "Network ACLs and security group rules allow relevant Internal traffic.",
      "C": "1",
      "CText": "Attach an Internet Gateway (IGW) to the Amazon VPC and create a subnet route table to send all non-local traffic to that IGW.",
      "D": "0",
      "DText": "Attach a Virtual Private Gateway (VPG) to the Amazon VPC and create subnet routes to send all non-local traffic to that VPG.",
      "E": "1",
      "EText": "The Amazon EC2 instance has a public IP address or Elastic IP (EIP) address.",
      "F": "0",
      "FText": "The Amazon EC2 instance does not need a public IP or Elastic IP when using Amazon VPC."
    },
    {
      "Question": "If you launch five Amazon Elastic Compute Cloud (Amazon EC2) instances in an Amazon Virtual Private Cloud (Amazon VPC) without specifying a security group, the instances will be launched into a default security group that provides which of the following? (Choose 3 answers)",
      "A": "1",
      "AText": "The five Amazon EC2 instances can communicate with each other.",
      "B": "0",
      "BText": "The five Amazon EC2 instances cannot communicate with each other.",
      "C": "0",
      "CText": "All inbound traffic will be allowed to the five Amazon EC2 instances.",
      "D": "1",
      "DText": "No inbound traffic will be allowed to the five Amazon EC2 instances.",
      "E": "1",
      "EText": "All outbound traffic will be allowed from the five Amazon EC2 instances",
      "F": "0",
      "FText": "No outbound traffic will be allowed from the five Amazon EC2 instances."
    },
    {
      "Question": "Your company wants to host its secure web application in AWS. The internal security policies consider any connections to or from the web server as insecure and require application data protection. What approaches should you use to protect data in transit for the application? (Choose 2 answers)",
      "A": "0",
      "AText": "Use BitLocker to encrypt data.",
      "B": "1",
      "BText": "Use HTTPS with server certificate authentication.",
      "C": "0",
      "CText": "Use an AWS Identity and Access Management (IAM) role",
      "D": "1",
      "DText": "Use Secure Sockets Layer (SSL)/Transport Layer Security (TLS) for database connection.",
      "E": "0",
      "EText": "Use XML for data transfer from client to server."
    },
    {
      "Question": "You have an application that will run on an Amazon Elastic Compute Cloud (Amazon EC2) instance. The application will make requests to Amazon Simple Storage Service (Amazon S3) and Amazon DynamoDB. Using best practices, what type of AWS identity and Access Management (IAM) identity should you create for your application to access the identified services?",
      "A": "1",
      "AText": "IAM role",
      "B": "0",
      "BText": "IAM user",
      "C": "0",
      "CText": "IAM group",
      "D": "0",
      "DText": "IAM directory"
    },
    {
      "Question": "When a request is made to an AWS Cloud service, the request is evaluated to decide whether it should be allowed or denied. The evaluation logic follows which of the following rules? (Choose 3 answers)",
      "A": "0",
      "AText": "An explicit allow overrides any denies.",
      "B": "1",
      "BText": "By default, all requests are denied.",
      "C": "1",
      "CText": "An explicit allow overrides the default.",
      "D": "1",
      "DText": "An explicit deny overrides any allows.",
      "E": "0",
      "EText": "By default, all requests are allowed."
    },
    {
      "Question": "What is the data processing engine behind Amazon Elastic MapReduce (Amazon EMR)?",
      "A": "1",
      "AText": "Apache Hadoop",
      "B": "0",
      "BText": "Apache Hive",
      "C": "0",
      "CText": "Apache Pug",
      "D": "0",
      "DText": "Apache HBase"
    },
    {
      "Question": "What type of AWS Elastic Beanstalk environment tier provisions resources to support a web application that handles background processing tasks?",
      "A": "0",
      "AText": "Web server environment tier",
      "B": "1",
      "BText": "Worker environment tier",
      "C": "0",
      "CText": "Database environment tier",
      "D": "0",
      "DText": "Batch environment tier"
    },
    {
      "Question": "What Amazon Relational Database Service (Amazon RDS) feature provides the high availability for your database?",
      "A": "0",
      "AText": "Regular maintenance windows",
      "B": "0",
      "BText": "Security groups",
      "C": "0",
      "CText": "Automated backups",
      "D": "1",
      "DText": "Multi-AZ deployment"
    },
    {
      "Question": "What administrative tasks are handled by AWS for Amazon Relational Database service (Amazon RDS) databases? (Choose 3 answers)",
      "A": "1",
      "AText": "Regular backups of the database",
      "B": "1",
      "BText": "Deploying virtual infrastructure",
      "C": "0",
      "CText": "Deploying the schema (for example, tables and stored procedures",
      "D": "1",
      "DText": "Patching the operating system and database software",
      "E": "0",
      "EText": "Setting up non-admin database accounts and privileges"
    },
    {
      "Question": "Which of the following use cases is well suited for Amazon Redshift?",
      "A": "1",
      "AText": "A 500TB data warehouse used for market analytics",
      "B": "0",
      "BText": "A NoSQL, unstructured database workload",
      "C": "0",
      "CText": "A high traffic, e-commerce web application",
      "D": "0",
      "DText": "An in-memory cache"
    },
    {
      "Question": "Which of the following statements about Amazon DynamoDB secondary indexes is true?",
      "A": "0",
      "AText": "There can be many per table, and they can be created at any time.",
      "B": "0",
      "BText": "There can only be one per table, and it must be created when the table is created.",
      "C": "0",
      "CText": "There can be many per table, and they can be created at any time.n",
      "D": "1",
      "DText": "There can only be one per table, and it must be created when the table is created."
    },
    {
      "Question": "What is the primary use case of Amazon Kinesis Firehose?",
      "A": "0",
      "AText": "Ingest huge streams of data and allow custom processing of data in flight.",
      "B": "1",
      "BText": "Ingest huge streams of data and store it to Amazon Simple Storage Service (Amazon S3), Amazon Redshift, or Amazon Elasticsearch Service.",
      "C": "0",
      "CText": "Generate a huge stream of data from an Amazon S3 bucket.",
      "D": "0",
      "DText": "Generate a huge stream of data from Amazon DynamoDB."
    },
    {
      "Question": "Your company has 17TB of financial trading records that need to be stored for seven years by law. Experience has shown that any record more than a year old is unlikely to be accessed. Which of the following storage plans meets these needs in the most cost-efficient manner?",
      "A": "0",
      "AText": "Store the data on Amazon Elastic Block Store (Amazon EBS) volume attached to t2.large.instances.",
      "B": "1",
      "BText": "Store the data on Amazon Simple Storage Service (Amazon S3) with lifecycle policies that change the storage class to Amazon Glacier after one year, and delete the object after seven years.",
      "C": "0",
      "CText": "Store the data in Amazon DynamaDB, and delete data older than seven years.",
      "D": "0",
      "DText": "Store the data in an Amazon Glacier Vault Lock."
    },
    {
      "Question": "What must you do to create a record of who accessed your Amazon Simple Storage Service (Amazon S3) data and from where?",
      "A": "0",
      "AText": "Enable Amazon ClouldWatch logs.",
      "B": "0",
      "BText": "Enable versioning on the bucket",
      "C": "0",
      "CText": "Enable website hosting on the bucket.",
      "D": "1",
      "DText": "Enable server access logs on the bucket.",
      "E": "0",
      "EText": "Create an AWS Identity and Access Management (IAM) bucket policy."
    },
    {
      "Question": "Amazon Simple Storage Service (Amazon S3) is an eventually consistent storage system. For what kinds of operations is it possible to get stale data as a result of eventual consistency?",
      "A": "0",
      "AText": "GET after PUT of a new object",
      "B": "0",
      "BText": "GET or LIST after a DELETE",
      "C": "1",
      "CText": "GET after overwrite PUT (PUT to an existing key)",
      "D": "0",
      "DText": "DELETE after GET of new object"
    },
    {
      "Question": "How is data stored in Amazon Simple Storage Service (Amazon S3) for high durability?",
      "A": "0",
      "AText": "Data is automatically replicated to other regions.",
      "B": "1",
      "BText": "Data Is automatically replicated to different Availability Zones within a region.",
      "C": "0",
      "CText": "Data is replicated only if versioning is enabled on the bucket.",
      "D": "0",
      "DText": "Data is automatically backed up on tape and restored if need."
    },
    {
      "Question": "Your company needs to provide streaming access to videos to authenticated users around the world. What is a good way to accomplish this?",
      "A": "0",
      "AText": "Use Amazon Simple Storage Service (Amazon S3) buckets in each region with website hosting enabled.",
      "B": "0",
      "BText": "Store the videos on Amazon Elastic Block Store (Amazon EBS) volumes.",
      "C": "1",
      "CText": "Enable Amazon CloudFront with geolocation and signed URLs.",
      "D": "0",
      "DText": "Runs a fleet of Amazon Elastic Compute Cloud (Amazon EC2) instances to host the videos."
    },
    {
      "Question": "Which of the following are true about the AWS shared responsibility model? (Choose 3 answers)",
      "A": "1",
      "AText": "AWS is responsible for all infrastructure components (that is, AWS Cloud services) that support customer deployments.",
      "B": "1",
      "BText": "The customer is responsible for the components from the guest operating system upward (including updates, security patches, and antivirus software)",
      "C": "0",
      "CText": "The customer may rely on AWS to manage the security of their workloads deployed on AWS.",
      "D": "1",
      "DText": "While AWS manages security of the cloud, security in the cloud is the responsibility of the customer.",
      "E": "0",
      "EText": "The customer must audit the AWS data centers personally to confirm the compliance of AWS systems and services."
    },
    {
      "Question": "Which process in and Amazon Simple Workflow Service (Amazon SWF) workflow implements a task?",
      "A": "0",
      "AText": "Decider",
      "B": "1",
      "BText": "Activity worker",
      "C": "0",
      "CText": "Workflow starter",
      "D": "0",
      "DText": "Business rule"
    },
    {
      "Question": "Which of the following is true if you stop and Amazon Elastic Compute Cloud (Amazon EC2) instance with an Elastic IP address in an Amazon Virtual Private Cloud (Amazon VPC)?",
      "A": "0",
      "AText": "The instance is disassociated from its Elastic IP address and must be re-attached when the instance is restarted.",
      "B": "1",
      "BText": "The instance remains associated with its Elastic IP address.",
      "C": "0",
      "CText": "The Elastic IP address is released from your account.",
      "D": "0",
      "DText": "The instance is disassociated from the Elastic IP address temporarily while you restart the instance."
    },
    {
      "Question": "Which Amazon Elastic Compute Cloud (Amazon EC2) pricing model allows you to pay a set hourly price for compute, giving you full control over when the instance launches and terminates?",
      "A": "0",
      "AText": "Spot instances",
      "B": "0",
      "BText": "Reserved instance",
      "C": "1",
      "CText": "On Demand instances",
      "D": "0",
      "DText": "Dedicated instances"
    },
    {
      "Question": "Under what circumstances will Amazon Elastic Compute Cloud (Amazon EC2) instance store data not be preserved?",
      "A": "0",
      "AText": "The associated security groups are changed.",
      "B": "0",
      "BText": "The instance is stopped or rebooted.",
      "C": "0",
      "CText": "The instance is rebooted or terminated",
      "D": "1",
      "DText": "The instance is stopped or terminated.",
      "E": "0",
      "EText": "None of the above."
    }
  ]
}